Tekla Open API Reference for Tekla Structures 2025
DetailMarkTagsAttributes.IsEqual Method
 Compares the current object with an object of the same type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool IsEqual(
	Object ObjectToCompare
)
Public Overrides Function IsEqual (
	ObjectToCompare As Object
) As Boolean
Parameters
ObjectToCompare
Type: System.Object
The object to be used for comparing.
Return Value
Type: Boolean
True if all the fields (except for the database GUID) of the objects match.
Implements
IIsEqual.IsEqual(Object)
See Also
Reference
DetailMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace